![png](erd.png)

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

import json
with open('/Users/austi/.secret/sql_login.json') as f:
    login = json.load(f)
login.keys()

connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movies-imdb"
engine = create_engine(connection)
conn = engine.connect()

## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [2]:
q = """
SHOW TABLES;
"""

pd.read_sql(q,conn)

  Tables_in_movies-imdb
0                genres
1               raitngs
2          title_basics
3          title_genres

## Prepping the title_basics table

In [3]:
q = """
SELECT * FROM title_basics;
"""

pd.read_sql(q,conn)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126
...,...,...,...,...
86974,tt9914942,Life Without Sara Amat,2019.0,74
86975,tt9915872,The Last White Witch,2019.0,97
86976,tt9916170,The Rehearsal,2019.0,51
86977,tt9916190,Safeguard,2020.0,95
86978,tt9916362,Coven,2020.0,92

In [4]:
basics = pd.read_csv("Data/basics_filtered.csv")
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      86979 non-null  int64
 1   tconst          86979 non-null  object
 2   titleType       86979 non-null  object
 3   primaryTitle    86979 non-null  object
 4   originalTitle   86979 non-null  object
 5   isAdult         86979 non-null  int64
 6   startYear       86979 non-null  float64
 7   endYear         0 non-null      float64
 8   runtimeMinutes  86979 non-null  int64
 9   genres          86979 non-null  object
dtypes: float64(2), int64(3), object(5)
memory usage: 6.6+ MB

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [5]:
basics = basics.drop(columns='Unnamed: 0',)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [6]:
# Checking table dtypes to ensure consistent
q = """
DESCRIBE title_basics;
"""

describe = pd.read_sql(q, conn)
describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(25)   NO  PRI    None
1  primary_title  varchar(250)  YES         None
2     start_year   varchar(10)  YES         None
3        runtime           int  YES         None

In [7]:
basics.dtypes

tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult             int64
startYear         float64
endYear           float64
runtimeMinutes      int64
genres             object
dtype: object

In [8]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [9]:
q = """ALTER TABLE title_basics
MODIFY COLUMN tconst VARCHAR(25);"""

conn.execute(q)

In [10]:
q = """ALTER TABLE title_basics
MODIFY COLUMN start_year VARCHAR(10);"""

conn.execute(q)

In [11]:
basics['startYear'] = basics['startYear'].astype(str)
basics.dtypes

tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult             int64
startYear          object
endYear           float64
runtimeMinutes      int64
genres             object
dtype: object

In [12]:
q = """ALTER TABLE title_basics
MODIFY COLUMN runtime INT;"""

conn.execute(q)

In [13]:
rename_basics = {
    "startYear":"start_year",
    "runtimeMinutes":"runtime",
    "primaryTitle":"primary_title"
}

basics.rename(rename_basics, axis=1, inplace=True)
basics.head()

,tconst,titleType,primary_title,originalTitle,isAdult,start_year,endYear,runtime,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [14]:
basics.drop(columns=['titleType', 'originalTitle', 'isAdult', 'endYear', 'genres'], inplace=True)
basics.head()

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [15]:
from sqlalchemy.types import *

#Find max length of the size column values
size_length = basics['primary_title'].fillna('').map(len).max()
size_length

242

In [16]:
q = """ALTER TABLE title_basics
MODIFY COLUMN primary_title VARCHAR(250);"""

conn.execute(q)

In [17]:
basics.to_sql("title_basics", conn, if_exists='append', index=False)

IntegrityError: (pymysql.err.IntegrityError) (1062, "Duplicate entry 'tt0035423' for key 'title_basics.PRIMARY'")
[SQL: INSERT INTO title_basics (tconst, primary_title, start_year, runtime) VALUES (%(tconst)s, %(primary_title)s, %(start_year)s, %(runtime)s)]
[parameters: ({'tconst': 'tt0035423', 'primary_title': 'Kate & Leopold', 'start_year': '2001.0', 'runtime': 118}, {'tconst': 'tt0062336', 'primary_title': 'The Tango of the Widower and Its Distorting Mirror', 'start_year': '2020.0', 'runtime': 70}, {'tconst': 'tt0069049', 'primary_title': 'The Other Side of the Wind', 'start_year': '2018.0', 'runtime': 122}, {'tconst': 'tt0088751', 'primary_title': 'The Naked Monster', 'start_year': '2005.0', 'runtime': 100}, {'tconst': 'tt0096056', 'primary_title': 'Crime and Punishment', 'start_year': '2002.0', 'runtime': 126}, {'tconst': 'tt0100275', 'primary_title': 'The Wandering Soap Opera', 'start_year': '2017.0', 'runtime': 80}, {'tconst': 'tt0103340', 'primary_title': 'Life for Life: Maximilian Kolbe', 'start_year': '2006.0', 'runtime': 90}, {'tconst': 'tt0108549', 'primary_title': 'West from North Goes South', 'start_year': '2004.0', 'runtime': 96}  ... displaying 10 of 86979 total bound parameter sets ...  {'tconst': 'tt9916190', 'primary_title': 'Safeguard', 'start_year': '2020.0', 'runtime': 95}, {'tconst': 'tt9916362', 'primary_title': 'Coven', 'start_year': '2020.0', 'runtime': 92})]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

## Prepping the ratings table

In [19]:
q = """
SELECT * FROM raitngs;
"""

pd.read_sql(q,conn)

Empty DataFrame
Columns: [tconstant, average_rating, number_of_votes]
Index: []

In [21]:
ratings = pd.read_csv('Data/ratings_filtered.csv')
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     71900 non-null  int64
 1   tconst         71900 non-null  object
 2   averageRating  71900 non-null  float64
 3   numVotes       71900 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 2.2+ MB

   Unnamed: 0     tconst  averageRating  numVotes
0       17961  tt0035423            6.4     87153
1       40764  tt0062336            6.4       175
2       46645  tt0069049            6.7      7754
3       63640  tt0088751            5.2       336
4       69953  tt0096056            5.6       846

In [22]:
ratings.drop(columns='Unnamed: 0', inplace=True)

In [23]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [24]:
# Checking table dtypes to ensure consistent
q = """
DESCRIBE raitngs;
"""

describe = pd.read_sql(q, conn)
describe

             Field         Type Null  Key Default Extra
0        tconstant          int   NO  PRI    None
1   average_rating  varchar(45)  YES         None
2  number_of_votes          int  YES         None

In [26]:
q = """ALTER TABLE raitngs
MODIFY COLUMN tconstant  VARCHAR(25);"""

conn.execute(q)

In [27]:
q = """ALTER TABLE raitngs
MODIFY COLUMN average_rating FLOAT;"""

conn.execute(q)

In [28]:
q = """ALTER TABLE raitngs
RENAME COLUMN tconstant TO tconst;"""

conn.execute(q)

In [29]:
# Checking table dtypes to ensure consistent
q = """
DESCRIBE raitngs;
"""

describe = pd.read_sql(q, conn)
describe

             Field         Type Null  Key Default Extra
0           tconst  varchar(25)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [30]:
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [32]:
rename_ratings = {
    "averageRating":"average_rating",
    "numVotes":"number_of_votes"
}

ratings.rename(rename_ratings, axis=1, inplace=True)
ratings.head()

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [33]:
ratings.to_sql("raitngs", conn, if_exists='append', index=False)

71900

In [34]:
q = """SHOW TABLES;"""

pd.read_sql(q,conn)

  Tables_in_movies-imdb
0                genres
1               raitngs
2          title_basics
3          title_genres

In [35]:
q = """DESCRIBE genres;"""

pd.read_sql(q,conn)

          Field         Type Null  Key Default Extra
0      genre_id          int   NO  PRI    None
1  title_genres  varchar(45)  YES         None

In [37]:
q = """DESCRIBE raitngs;"""

pd.read_sql(q,conn)

             Field         Type Null  Key Default Extra
0           tconst  varchar(25)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [38]:
q = """DESCRIBE title_basics;"""

pd.read_sql(q,conn)

           Field          Type Null  Key Default Extra
0         tconst   varchar(25)   NO  PRI    None
1  primary_title  varchar(250)  YES         None
2     start_year   varchar(10)  YES         None
3        runtime           int  YES         None

In [39]:
q = """DESCRIBE title_genres;"""

pd.read_sql(q,conn)

       Field Type Null  Key Default Extra
0  tconstant  int   NO  PRI    None
1   genre_id  int   NO  PRI    None

In [40]:
q = """
SELECT * FROM genres
"""

pd.read_sql(q, conn)

Empty DataFrame
Columns: [genre_id, title_genres]
Index: []

In [42]:
q = """
SELECT * FROM raitngs LIMIT 5;
"""

pd.read_sql(q, conn)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [43]:
q = """
SELECT * FROM title_basics LIMIT 5;
"""

pd.read_sql(q, conn)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [44]:
q = """
SELECT * FROM title_genres
"""

pd.read_sql(q, conn)

Empty DataFrame
Columns: [tconstant, genre_id]
Index: []